W6D5/99 cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", ""], ["updated_at", "2020-03-23 23:39:57.763989"], ["id", 1]]
---
    def update
        @cat = Cat.find(params[:id])
        if @cat.update_attributes(cat_params)