W6D3/project1/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "img_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "adf"], ["img_url", "asdfaf"], ["artist_id", 1]]
---
    def create
        artwork = Artwork.new(params.require(:artwork).permit(:title, :img_url, :artist_id))

        if artwork.save