W6D3/project1/app/controllers/artwork_shares_controller.rb

     def create
            share = ArtworkShare.new(params.require(:artwork_share).permit(:artwork_id, :viewer_id))

        if share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 1]]