W6D3/project1/app/controllers/users_controller.rb

INSERT INTO "users" ("id", "name", "circle", "email", "user") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 1], ["name", "eric"], ["circle", "mike"], ["email", "e@g.c"], ["user", "ericeric"]]
---
    def create
        user = User.new(params.require(:user).permit(:username))

        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        user = User.find(params[:username])